#include "Pump_pwm.h"



//----对应档位水压表格
uint_8 Water_press_table[5] = {
		0x00,      //关闭气泵
		0x5F,
		0x7F,
		0x9F,
		0xAE,
};




//***********************************************************************************************************************
//*函数名称： PWM_Init
//*函数功能： 初始化PWM寄存器设置。
//*
//*输入参数： 无
//*输出参数：	无
//***********************************************************************************************************************

void PWM_Init(void)
{
	/*------PWM0调节-------------控制增压泵--------------------------*/
	//常态不工作时输出低电平
	PWM_Control(OFF,Water_press_table[0]);  //全计数为256,0x40代表占空比为1/4 
}


//***********************************************************************************************************************
//*函数名称： PWM_Control
//*函数功能： PWM波输出信号控制。
//*
//*输入参数： status:为开关PWM状态标识，取值为ON或OFF，ON为开PWM功能，OFF为关PWM功能
//*			ratio:为PWM波占空比调节字节，全计数为256，若占空比要求为1/4，即取值为0x40 = 64
//*输出参数：	无
//***********************************************************************************************************************
void PWM_Control(uchar status,uchar ratio)
{
	if(status == OFF)	//关PWM
	{
		TM0MD&=~0X08;	//停止计数器
		PAOMD&=~0X01;	//设置PA0位普通功能引脚
	}
	else
	{
		PAOMD|=0X01;	//设置PA0为特殊引脚功能
	}
	PADIR|=0X01;	//IO口反向设置	
	TM0MD|=0X10;	//TM0PWM标志置1，设为PWM操作
	TM0MD&=0X9F;	//清除TM0MOD和TM0POP标志
	TM0MD|=0X01;	//选择计数器时钟源
	TM0MD&=0XF9;	//清除其他位
	CK0MD=0X01;		//无附加脉冲，TM0BAS位置1，选择fs/2为预分频器输出
	TM0OC = Water_press_table[ratio];		//设置PWM输出“H”期间的值，即占空比，全计数为256,40H=64，即为1/4占空比
	if(status == ON)
		TM0MD|=0X08;  	//启动定时器
	else
		PAOUT&=~0X01;	//没启用定时器时作为普通IO口时要拉低
}









